TheRo0T/CAN-USB-STM32/STM32F105/Src/main.c
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {

    if (huart->Instance == USART1) {
        // switch buffer
        uartRxBuffer[currentUartRxBuffer].filled = 1;
        currentUartRxBuffer++;
        currentUartRxBuffer %= UART_RX_BUFFERS_COUNT;
        if (!uartRxBuffer[currentUartRxBuffer].readed) {
            throwError("UART RX OVERRUN");
        }

        startUartDmaReceive(huart, &uartRxBuffer[currentUartRxBuffer]);
    }
}

void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart) {
    uint32_t code = huart->ErrorCode;
    if (code & HAL_UART_ERROR_PE) { throwError("UART error: Parity error"); }
    if (code & HAL_UART_ERROR_NE) { throwError("UART error: Noise error"); }
    if (code & HAL_UART_ERROR_FE) { throwError("UART error: frame error"); }
    if (code & HAL_UART_ERROR_ORE) { throwError("UART error: Overrun error"); }
    if (code & HAL_UART_ERROR_DMA) { throwError("UART error: DMA error"); }
    char str[80];
    sprintf(str, "Uart error code: %X", (unsigned int)code);
    throwError(str);
}

void HAL_CAN_TxCpltCallback(CAN_HandleTypeDef* hcan) {
    printf("HAL_CAN_TxCpltCallback\n");
    txCan();
}

void HAL_CAN_RxCpltCallback(CAN_HandleTypeDef* hcan) {
    HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_13);
    CanRxMsgTypeDef *rxMsg = malloc(sizeof(CanRxMsgTypeDef));
    memcpy(rxMsg, hcan->pRxMsg, sizeof(CanRxMsgTypeDef));

    osMessagePut (canRxQueueHandle, (uint32_t)rxMsg, osWaitForever);
    rxCan();
}

void HAL_CAN_ErrorCallback(CAN_HandleTypeDef *hcan) {
    throwError("HAL_CAN_ErrorCallback");
}

void rxCan() {
    HAL_StatusTypeDef result = HAL_CAN_Receive_IT(&hcan1, CAN_FIFO0);
    switch (result) {
        case HAL_OK: break;
        case HAL_ERROR:
            throwError("HAL_CAN_Receive_IT: error");
            break;
        case HAL_BUSY:
            throwError("HAL_CAN_Receive_IT: busy");
            break;
        case HAL_TIMEOUT:
            throwError("HAL_CAN_Receive_IT: timeout");
            break;
    }
    switch (hcan1.ErrorCode) {
        case HAL_CAN_ERROR_NONE: break;       /*!< No error             */
        case HAL_CAN_ERROR_EWG:               /*!< EWG error            */
        case HAL_CAN_ERROR_EPV:               /*!< EPV error            */
        case HAL_CAN_ERROR_BOF:               /*!< BOF error            */
        case HAL_CAN_ERROR_STF:               /*!< Stuff error          */
        case HAL_CAN_ERROR_FOR:               /*!< Form error           */
        case HAL_CAN_ERROR_ACK:               /*!< Acknowledgment error */
        case HAL_CAN_ERROR_BR:                /*!< Bit recessive        */
        case HAL_CAN_ERROR_BD:                /*!< LEC dominant         */
        case HAL_CAN_ERROR_CRC:
            throwError("RXCAN ERROR");
            break;
    }
}

void txCan() {
    if (hcan1.State == HAL_CAN_STATE_READY && hcan1.txState == HAL_CAN_RXTX_STATE_READY) {

        osEvent event = osMessageGet(canTxQueueHandle, osWaitForever);
        if (event.status == osEventMessage) {
            //memcpy(hcan.pTxMsg, event.value.p, sizeof(CanTxMsgTypeDef));
            can1TxMessage = *(CanTxMsgTypeDef *)event.value.p;
            HAL_StatusTypeDef result = HAL_CAN_Transmit_IT(&hcan1);
            free(event.value.p);
            switch (result) {
                case HAL_OK: break;
                case HAL_ERROR:
                    throwError("HAL_CAN_Transmit_IT: error");
                    break;
                case HAL_BUSY:
                    throwError("HAL_CAN_Transmit_IT: busy");
                    break;
                case HAL_TIMEOUT:
                    throwError("HAL_CAN_Transmit_IT: timeout");
                    break;
            }
            switch (hcan1.ErrorCode) {
                case HAL_CAN_ERROR_NONE: break;       /*!< No error             */
                case HAL_CAN_ERROR_EWG:               /*!< EWG error            */
                case HAL_CAN_ERROR_EPV:               /*!< EPV error            */
                case HAL_CAN_ERROR_BOF:               /*!< BOF error            */
                case HAL_CAN_ERROR_STF:               /*!< Stuff error          */
                case HAL_CAN_ERROR_FOR:               /*!< Form error           */
                case HAL_CAN_ERROR_ACK:               /*!< Acknowledgment error */
                case HAL_CAN_ERROR_BR:                /*!< Bit recessive        */
                case HAL_CAN_ERROR_BD:                /*!< LEC dominant         */
                case HAL_CAN_ERROR_CRC:
                    throwError("TXCAN error advanced");
                    break;
            }
        }
    } else {
        //printf("State is %d\n", hcan1.State);
        //throwError("State");
    }
}

void transmitErrorMessage(char *message) {
    int len = strlen((char *)message);
    char *str = malloc(len+3);
    memcpy(str, message, len);
    str[len] = '\r';
    str[len+1] = '\n';
    str[len+2] = '\0';


    osMessagePut (uartTxQueueHandle, (uint32_t)str, osWaitForever);
    txUart();

    return;
}

void gotoNextBufferToRead() {
    if (currentUartRxBufferToRead != currentUartRxBuffer) {
        currentUartRxBufferToRead++;
        currentUartRxBufferToRead %= UART_RX_BUFFERS_COUNT;
    }
}

int processUartDmaBuffer(UART_HandleTypeDef *huart, UART_DMA_RX_Buffer *uartRxBuffer) {
    int itemsProcessed = 0;

    if (uartRxBuffer->readed) {
        return itemsProcessed;
    }

    int dmaOffset;
    if (uartRxBuffer->filled) {
        dmaOffset = UART_RX_BUFFER;
    } else {
        dmaOffset = huart->RxXferSize - huart->hdmarx->Instance->CNDTR;
    }
    int bytesReady = dmaOffset - uartRxBuffer->offset;

    if (bytesReady > 0) {

        while(uartRxBuffer->offset < dmaOffset) {
            uint8_t c = uartRxBuffer->buffer[uartRxBuffer->offset];
            switch (c) {
                case '\0':
                case '\r':
                case '\n':
                    if (uartLineIndex > 0) {
                        uartLine[uartLineIndex++] = '\0';
                        /*uint8_t *str = malloc(uartLineIndex);
                        memcpy(str, uartLine, uartLineIndex);*/

                        CanHacker_Receive_Cmd(&hcanhacker, uartLine);

