TheRo0T/CAN-USB-STM32/STM32F105/Src/main.c
                        uartLineIndex = 0;
                        /*osStatus status = osMessagePut(uartRxQueueHandle, (uint32_t)str, osWaitForever);
                        switch (status) {
                            case osOK:
                                break;
                            default:
                                throwError("Error put to queue");
                                break;
                        }*/
                    }
                    break;
                default:
                    uartLine[uartLineIndex++] = c;
                    break;
            }

            uartRxBuffer->offset++;
        }

        itemsProcessed++;
    }

    if (uartRxBuffer->offset >= UART_RX_BUFFER) {
        uartRxBuffer->readed = 1;
        uartRxBuffer->offset = 0;
        uartRxBuffer->filled = 0;

        gotoNextBufferToRead();
    }

    return itemsProcessed;
}

void CanHacker_ErrorCallback(CanHacker_HandleTypeDef *canhacker, char *message) {
    throwError(message);
}

void CanHacker_CanTxMsgReadyCallback(CanHacker_HandleTypeDef *canhacker, CanTxMsgTypeDef *txMsg) {
    CanTxMsgTypeDef *txMsgQ = malloc(sizeof(CanTxMsgTypeDef));
    memcpy(txMsgQ, txMsg, sizeof(CanTxMsgTypeDef));

    osMessagePut (canTxQueueHandle, (uint32_t)txMsgQ, osWaitForever);
    txCan();

    return;
}

void CanHacker_UartMsgReadyCallback(CanHacker_HandleTypeDef *canhacker, uint8_t *line) {
    int len = strlen((char *)line);
    char *str = malloc(len+1);
    memcpy(str, line, len+1);
    osMessagePut (uartTxQueueHandle, (uint32_t)str, osWaitForever);
    txUart();
}

uint32_t CanHacker_GetTimestampCallback(CanHacker_HandleTypeDef *canhacker) {
    return htim6.Instance->CNT;
}

void CanHacker_StartTimerCallback(CanHacker_HandleTypeDef *canhacker) {
    HAL_TIM_Base_Start(&htim6);
}

void CanHacker_StopTimerCallback(CanHacker_HandleTypeDef *canhacker) {
    HAL_TIM_Base_Stop(&htim6);
}

/* USER CODE END 4 */

/* StartDefaultTask function */
void StartDefaultTask(void const * argument)
{
  /* init code for USB_DEVICE */
  //MX_USB_DEVICE_Init();

  /* USER CODE BEGIN 5 */
    rxCan();

    /* Infinite loop */
    for(;;)
    {
        int itemsProcessed = 0;

        osEvent canEvent = osMessageGet(canRxQueueHandle, osWaitForever);
        if (canEvent.status == osEventMessage) {

            CanHacker_Receive_CanMsg(&hcanhacker, (CanRxMsgTypeDef *)canEvent.value.p);
            free(canEvent.value.p);

            itemsProcessed++;
        }

        // sleep only when nothing to do
        if (!itemsProcessed) {
            osDelay(1);
        }
    }
  /* USER CODE END 5 */ 
}

/* StartUartRxDmaTask function */
void StartUartRxDmaTask(void const * argument)
{
  /* USER CODE BEGIN StartUartRxDmaTask */

    currentUartRxBuffer = 0;
    currentUartRxBufferToRead = 0;
    startUartDmaReceive(&huart1, &uartRxBuffer[currentUartRxBuffer]);

    for(;;) {
        int itemsProcessed = processUartDmaBuffer(&huart1, &uartRxBuffer[currentUartRxBufferToRead]);
        if (!itemsProcessed) {
            osDelay(1);
        }
    }
  /* USER CODE END StartUartRxDmaTask */
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
    printf("Wrong parameters value: file %s on line %d\r\n", (char *)file, (int *)line);
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
